Revit 2027 API
CurveByPointsUtils.SetProjectionType Method
 Sets the projection type of the CurveElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetProjectionType(
	CurveElement curveElem,
	CurveProjectionType value
)
Public Shared Sub SetProjectionType (
	curveElem As CurveElement,
	value As CurveProjectionType
)
public:
static void SetProjectionType(
	CurveElement^ curveElem,
	CurveProjectionType value
)
static member SetProjectionType :
        curveElem : CurveElement *
        value : CurveProjectionType -> unit
Parameters
curveElem CurveElement
 The CurveElement.
value CurveProjectionType
 The input projection type.
Exceptions
Exception | Condition
ArgumentException |  The input CurveElement is not a CurveByPoints.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace